/**
 * @license
 * SPDX-License-Identifier: Apache-2.0
 */

import { VerseItem } from "../types";

export const SAMPLE_NOACH_RISHON: VerseItem[] = [
  {
    "id": "Genesis 6:9",
    "chapter": 6,
    "verse": 9,
    "verseHebrew": "",
    "aliyahIndex": 0,
    "aliyahName": "ראשון",
    "mikraHebrew": "אֵ֚לֶּה תּוֹלְדֹ֣ת נֹ֔חַ נֹ֗חַ אִ֥ישׁ צַדִּ֛יק תָּמִ֥ים הָיָ֖ה בְּדֹֽרֹתָ֑יו אֶת־הָֽאֱלֹהִ֖ים הִֽתְהַלֶּךְ־נֹֽחַ׃",
    "targumHebrew": "אִלֵּין תּוּלְדַת נֹחַ נֹחַ גְּבַר זַכַּאי שְׁלִים הֲוָה בְּדָרוֹהִי בְּ<b>דַחַלְתָּא דַ</b>יְיָ הַלִּיךְ נֹחַ:",
    "rashiText": "<b>אלה תולדת נח נח איש צדיק.</b> הוֹאִיל וְהִזְכִּירוֹ סִפֵּר בְּשִׁבְחוֹ, שֶׁנֶּאֱמַר זֵכֶר צַדִּיק לִבְרָכָה (משלי י'). דָּבָר אַחֵר לִמֶּדְךָ שֶׁעִקַּר תּוֹלְדוֹתֵיהֶם שֶׁל צַדִּיקִים מַעֲשִׂים טוֹבִים: <b>בדרותיו.</b> יֵשׁ מֵרַבּוֹתֵינוּ דּוֹרְשִׁים אוֹתוֹ לְשֶׁבַח, כָּל שֶׁכֵּן אִלּוּ הָיָה בְדוֹר צַדִּיקִים הָיָה צַדִּיק יוֹתֵר; וְיֵשׁ שֶׁדּוֹרְשִׁים אוֹתוֹ לִגְנַאי, לְפִי דוֹרוֹ הָיָה צַדִּיק וְאִלּוּ הָיָה בְדוֹרוֹ שֶׁל אַבְרָהָם לֹא הָיָה נֶחְשָׁב לִכְלוּם (סנה' ק\"ח): <b>את האלהים התהלך נח.</b> וּבְאַבְרָהָם הוּא אוֹמֵר אֲשֶׁר הִתְהַלַּכְתִּי לְפָנָיו? (ברא' כ\"ד), נֹחַ הָיָה צָרִיךְ סַעַד לְתָמְכוֹ, אֲבָל אַבְרָהָם הָיָה מִתְחַזֵּק וּמְהַלֵּךְ בְצִדְקוֹ מֵאֵלָיו: <b>התהלך.</b> לְשׁוֹן עָבָר, וְזֶהוּ שִׁמּוּשׁוֹ שֶׁל לָשׁוֹן, בְּלָשׁוֹן כָּבֵד מְשַׁמֶּשֶׁת לְהַבָּא וּלְשֶׁעָבַר בְּלָשׁוֹן א', קוּם הִתְהַלֵּךְ (שם י\"ג) לְהַבָּא, הִתְהַלֶּךְ נֹחַ לְשֶׁעָבַר; הִתְפַּלֵּל בְּעַד עֲבָדֶיךָ (שמואל א' י\"ב) לְהַבָּא, וּבָא וְהִתְפַּלֵּל אֶל הַבַּיִת הַזֶּה (מ\"א ח') לְשׁוֹן עָבָר, אֶלָּא שֶׁהַוָּי\"ו שֶׁבְּרֹאשׁוֹ הֲפָכוֹ לְהַבָּא:",
    "englishText": "This is the line of Noah.—Noah was a righteous man; he was blameless in his age; Noah walked with God.—"
  },
  {
    "id": "Genesis 6:10",
    "chapter": 6,
    "verse": 10,
    "verseHebrew": "",
    "aliyahIndex": 0,
    "aliyahName": "ראשון",
    "mikraHebrew": "וַיּ֥וֹלֶד נֹ֖חַ שְׁלֹשָׁ֣ה בָנִ֑ים אֶת־שֵׁ֖ם אֶת־חָ֥ם וְאֶת־יָֽפֶת׃",
    "targumHebrew": "וְאוֹלִיד נֹחַ תְּלָתָא בְנִין יָת שֵׁם יָת חָם וְיָת יָפֶת:",
    "rashiText": "",
    "englishText": "Noah begot three sons: Shem, Ham, and Japheth."
  },
  {
    "id": "Genesis 6:11",
    "chapter": 6,
    "verse": 11,
    "verseHebrew": "",
    "aliyahIndex": 0,
    "aliyahName": "ראשון",
    "mikraHebrew": "וַתִּשָּׁחֵ֥ת הָאָ֖רֶץ לִפְנֵ֣י הָֽאֱלֹהִ֑ים וַתִּמָּלֵ֥א הָאָ֖רֶץ חָמָֽס׃",
    "targumHebrew": "וְאִתְחַבָּלַת אַרְעָא קֳדָם יְיָ וְאִתְמְלִיאַת אַרְעָא חֲטוֹפִין:",
    "rashiText": "<b>ותשחת.</b> לְשׁוֹן עֶרְוָה וַעֲ\"זָ (סנה' נ\"ז) כְּמוֹ פֶּן תַּשְׁחִתוּן (דב' ד'), כִּי הִשְׁחִית כָּל בָּשָׂר וְגוֹ': <b>ותמלא הארץ חמס.</b> גֶּזֶל:",
    "englishText": "The earth became corrupt before God; the earth was filled with lawlessness."
  },
  {
    "id": "Genesis 6:12",
    "chapter": 6,
    "verse": 12,
    "verseHebrew": "",
    "aliyahIndex": 0,
    "aliyahName": "ראשון",
    "mikraHebrew": "וַיַּ֧רְא אֱלֹהִ֛ים אֶת־הָאָ֖רֶץ וְהִנֵּ֣ה נִשְׁחָ֑תָה כִּֽי־הִשְׁחִ֧ית כׇּל־בָּשָׂ֛ר אֶת־דַּרְכּ֖וֹ עַל־הָאָֽרֶץ׃&nbsp;<span class=\"mam-spi-samekh\">{ס}</span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;",
    "targumHebrew": "וַחֲזָא יְיָ יָת אַרְעָא וְהָא אִתְחַבָּלַת אֲרֵי חַבִּילוּ כָּל בִּשְׂרָא <b>אֱנַשׁ</b> יָת אָרְחֵהּ עַל אַרְעָא:",
    "rashiText": "<b>כי השחית כל בשר.</b> אֲפִלּוּ בְהֵמָה חַיָּה וָעוֹף נִזְקָקִין לְשֶׁאֵינָן מִינָן:",
    "englishText": "When God saw how corrupt the earth was, for all flesh had corrupted its ways on earth, "
  },
  {
    "id": "Genesis 6:13",
    "chapter": 6,
    "verse": 13,
    "verseHebrew": "",
    "aliyahIndex": 0,
    "aliyahName": "ראשון",
    "mikraHebrew": "וַיֹּ֨אמֶר אֱלֹהִ֜ים לְנֹ֗חַ קֵ֤ץ כׇּל־בָּשָׂר֙ בָּ֣א לְפָנַ֔י כִּֽי־מָלְאָ֥ה הָאָ֛רֶץ חָמָ֖ס מִפְּנֵיהֶ֑ם וְהִנְנִ֥י מַשְׁחִיתָ֖ם אֶת־הָאָֽרֶץ׃",
    "targumHebrew": "וַאֲמַר יְיָ לְנֹחַ קִצָּא דְכָל בִּשְׂרָא עַלַּת לִקֳדָמַי אֲרֵי אִתְמְלִיאַת אַרְעָא חֲטוֹפִין מִן קֳדָם <b>עוֹבָדֵיהוֹן בִּישַׁיָּא</b> וְהָא אֲנָא מְחַבֶּלְהוֹן עִם אַרְעָא:",
    "rashiText": "<b>קץ כל בשר.</b> כָּל מָקוֹם שֶׁאַתָּה מוֹצֵא זְנוּת וַעֲ\"זָ אַנְדְּרוֹלוֹמוּסְיָא בָּאָה לְעוֹלָם וְהוֹרֶגֶת טוֹבִים וְרָעִים. <b>כי מלאה הארץ חמס.</b> לֹא נֶחְתַּם גְּזַר דִּינָם אֶלָּא עַל הַגֶּזֶל (סנה' ק\"ח): <b>את הארץ.</b> כְּמוֹ מִן הָאָרֶץ, וְדוֹמֶה לוֹ כְּצֵאתִי אֶת הָעִיר (שמ' ט'), מִן הָעִיר; חָלָה אֶת רַגְלָיו (מ\"א ט\"ו), מִן רַגְלָיו. דָּ\"אַ אֶת הָאָרֶץ – עִם הָאָרֶץ, שֶׁאַף ג' טְפָחִים שֶׁל עֹמֶק הַמַּחֲרֵשָׁה נִמֹּחוּ וְנִטַּשְׁטְשׁוּ:",
    "englishText": "God said to Noah, “I have decided to put an end to all flesh, for the earth is filled with lawlessness because of them: I am about to destroy them with the earth. "
  },
  {
    "id": "Genesis 6:14",
    "chapter": 6,
    "verse": 14,
    "verseHebrew": "",
    "aliyahIndex": 0,
    "aliyahName": "ראשון",
    "mikraHebrew": "עֲשֵׂ֤ה לְךָ֙ תֵּבַ֣ת עֲצֵי־גֹ֔פֶר קִנִּ֖ים תַּֽעֲשֶׂ֣ה אֶת־הַתֵּבָ֑ה וְכָֽפַרְתָּ֥ אֹתָ֛הּ מִבַּ֥יִת וּמִח֖וּץ בַּכֹּֽפֶר׃",
    "targumHebrew": "עִיבֵד לָךְ תֵּבוֹתָא דְאָעִין דְּקַדְרוֹם מְדוֹרִין תַּעְבֵּד יָת תֵּבוֹתָא וְתֶחְפֵּי יָתַהּ מִגָּו וּמִבָּרָא בְּכָפְרָא:",
    "rashiText": "<b>עשה לך תבת.</b> הַרְבֵּה רֶוַח וְהַצָּלָה לְפָנָיו, וְלָמָּה הִטְרִיחוֹ בְּבִנְיָן זֶה? כְּדֵי שֶׁיִּרְאוּהוּ אַנְשֵׁי דוֹר הַמַּבּוּל עוֹסֵק בָּהּ ק\"כ שָׁנָה, וְשׁוֹאֲלִין אוֹתוֹ מַה זֹּאת לְךָ, וְהוּא אוֹמֵר לָהֶם עָתִיד הַקָּבָּ\"ה לְהָבִיא מַבּוּל לָעוֹלָם, אוּלַי יָשׁוּבוּ: <b>עצי גופר.</b> כָּךְ שְׁמוֹ. וְלָמָּה מִמִּין זֶה? עַל שֵׁם גָּפְרִית שֶׁנִּגְזַר עֲלֵיהֶם לִמָּחוֹת בּוֹ: <b>קנים.</b> מְדוֹרִים מְדוֹרִים לְכָל בְּהֵמָה וְחַיָּה: <b>בכפר.</b> זֶפֶת בְלָשׁוֹן אֲרַמִּי, וּמָצִינוּ בַּתַּלְמוּד כּוּפְרָא בְּתֵבָתוֹ שֶׁל משֶׁה, עַל יְדֵי שֶׁהָיוּ הַמַּיִם תָּשִׁים דַּיָּהּ בְּחֹמֶר מִבִּפְנִים וְזֶפֶת מִבַּחוּץ; וְעוֹד, כְּדֵי שֶׁלֹּא יָרִיחַ אוֹתוֹ צַדִּיק רֵיחַ רַע שֶׁל זֶפֶת, אֲבָל כָּאן מִפְּנֵי חֹזֶק הַמַּיִם זִפְּתָהּ מִבַּיִת וּמִחוּץ:",
    "englishText": "Make yourself an ark of <i>gopher</i> wood; make it an ark with compartments, and cover it inside and out with pitch. "
  },
  {
    "id": "Genesis 6:15",
    "chapter": 6,
    "verse": 15,
    "verseHebrew": "",
    "aliyahIndex": 0,
    "aliyahName": "ראשון",
    "mikraHebrew": "וְזֶ֕ה אֲשֶׁ֥ר תַּֽעֲשֶׂ֖ה אֹתָ֑הּ שְׁלֹ֧שׁ מֵא֣וֹת אַמָּ֗ה אֹ֚רֶךְ הַתֵּבָ֔ה חֲמִשִּׁ֤ים אַמָּה֙ רׇחְבָּ֔הּ וּשְׁלֹשִׁ֥ים אַמָּ֖ה קוֹמָתָֽהּ׃",
    "targumHebrew": "וְדֵין דִתַעֲבֵּד יָתַהּ תְּלָת מְאָה אַמִּין אוּרְכָּא דְתֵבוֹתָא חַמְשִׁין אַמִּין פְּתָיַהּ וּתְלָתִין אַמִּין רוּמַהּ:",
    "rashiText": "",
    "englishText": "This is how you shall make it: the length of the ark shall be three hundred cubits, its width fifty cubits, and its height thirty cubits. "
  },
  {
    "id": "Genesis 6:16",
    "chapter": 6,
    "verse": 16,
    "verseHebrew": "",
    "aliyahIndex": 0,
    "aliyahName": "ראשון",
    "mikraHebrew": "צֹ֣הַר&thinsp;<b>׀</b> תַּעֲשֶׂ֣ה לַתֵּבָ֗ה וְאֶל־אַמָּה֙ תְּכַלֶּ֣נָּה מִלְמַ֔עְלָה וּפֶ֥תַח הַתֵּבָ֖ה בְּצִדָּ֣הּ תָּשִׂ֑ים תַּחְתִּיִּ֛ם שְׁנִיִּ֥ם וּשְׁלִשִׁ֖ים תַּֽעֲשֶֽׂהָ׃",
    "targumHebrew": "<b>נֵהוֹר</b> תַּעְבֵּיד לְתֵבוֹתָא וּלְאַמְתָא תְּשַׁכְלְלִנַּהּ מִלְּעֵלָּא וְתַרְעָא דְתֵבוֹתָא בְּסִטְרַהּ תְּשַׁוִּי מְדוֹרִין אַרָעִין תִּנְיָנִין וּתְלִיתָאִין תַּעְבְּדִנַּהּ:",
    "rashiText": "<b>צהר.</b> יֵ\"אֹ חַלּוֹן וְיֵ\"אֹ אֶבֶן טוֹבָה הַמְּאִירָה לָהֶם (ב\"ר שם): <b>ואל אמה תכלנה מלמעלה.</b> כִּסּוּיָהּ מְשֻׁפָּע וְעוֹלֶה עַד שֶׁהוּא קָצָר מִלְמַעְלָה וְעוֹמֵד עַל אַמָּה כְּדֵי שֶׁיָּזוּבוּ הַמַּיִם לְמַטָּה מִכָּאן וּמִכָּאן: <b>בצדה תשים.</b> שֶׁלֹּא יִפְּלוּ הַגְּשָׁמִים בָּהּ: <b>תחתים שנים ושלשים.</b> ג' עֲלִיוֹת זוֹ עַל גַּב זוֹ, עֶלְיוֹנִים לָאָדָם, אֶמְצָעִים לְמָדוֹֹר, תַּחְתִּיִּים לְזֶבֶל (שם):",
    "englishText": "Make an opening for daylight in the ark, and terminate it within a cubit of the top.<sup class=\"footnote-marker\">c</sup><i class=\"footnote\"><b>terminate it within a cubit of the top </b>Meaning of Heb. uncertain.</i> Put the entrance to the ark in its side; make it with bottom, second, and third decks."
  },
  {
    "id": "Genesis 6:17",
    "chapter": 6,
    "verse": 17,
    "verseHebrew": "",
    "aliyahIndex": 0,
    "aliyahName": "ראשון",
    "mikraHebrew": "וַאֲנִ֗י הִנְנִי֩ מֵבִ֨יא אֶת־הַמַּבּ֥וּל מַ֙יִם֙ עַל־הָאָ֔רֶץ לְשַׁחֵ֣ת כׇּל־בָּשָׂ֗ר אֲשֶׁר־בּוֹ֙ ר֣וּחַ חַיִּ֔ים מִתַּ֖חַת הַשָּׁמָ֑יִם כֹּ֥ל אֲשֶׁר־בָּאָ֖רֶץ יִגְוָֽע׃",
    "targumHebrew": "וַאֲנָא הָא אֲנָא מַיְתֵי יָת טוֹפָנָא מַיָּא עַל אַרְעָא לְחַבָּלָא כָּל בִּשְׂרָא דִּי בֵיהּ רוּחָא דְחַיֵּי מִתְּחוֹת שְׁמַיָּא כֹּל דִּי בְאַרְעָא יְמוּת:",
    "rashiText": "<b>ואני הנני מביא.</b> הִנְנִי מוּכָן לְהַסְכִּים עִם אוֹתָם שֶׁזֵּרְזוּנִי וְאָמְרוּ לְפָנַי כְּבָר מָה אֱנוֹשׁ כִּי תִזְכְּרֶנּוּ (תה' ח'): <b>מבול.</b> שֶׁבִּלָּה אֶת הַכֹּל, שֶׁבִּלְבֵּל אֶת הַכֹּל, שֶׁהוֹבִיל אֶת הַכֹּל מִן הַגָּבוֹהַּ לַנָּמוּךְ; וְזֶהוּ לְשׁוֹן אֻנְקְלוֹס שֶׁתִּרְגֵּם טוֹפָנָא, שֶׁהֵצִיף אֶת הַכֹּל, וֶהֱבִיאָהּ לְבָבֶל שֶׁהִיא עֲמֻקָּה, לְכָךְ נִקְרֵאת שִׁנְעָר, שֶׁנִּנְעֲרוּ שָׁם כָּל מֵתֵי מַבּוּל:",
    "englishText": "“For My part, I am about to bring the Flood—waters upon the earth—to destroy all flesh under the sky in which there is breath of life; everything on earth shall perish. "
  },
  {
    "id": "Genesis 6:18",
    "chapter": 6,
    "verse": 18,
    "verseHebrew": "",
    "aliyahIndex": 0,
    "aliyahName": "ראשון",
    "mikraHebrew": "וַהֲקִמֹתִ֥י אֶת־בְּרִיתִ֖י אִתָּ֑ךְ וּבָאתָ֙ אֶל־הַתֵּבָ֔ה אַתָּ֕ה וּבָנֶ֛יךָ וְאִשְׁתְּךָ֥ וּנְשֵֽׁי־בָנֶ֖יךָ אִתָּֽךְ׃",
    "targumHebrew": "וְאָקֵם יָת קְיָמִי עִמָּךְ וְתֵעוֹל לְתֵבוֹתָא אַתְּ וּבְנָךְ וְאִתְּתָךְ וּנְשֵׁי בְנָךְ עִמָּךְ:",
    "rashiText": "<b>והקמתי את בריתי.</b> בְּרִית הָיָה צָרִיךְ עַל הַפֵּרוֹת שֶׁלֹּא יִרְקְבוּ וִיעַפְּשׁוּ וְשֶׁלֹּא יַהַרְגוּהוּ רְשָׁעִים שֶׁבַּדּוֹר (ב\"ר): <b>אתה ובניך ואשתך.</b> הָאֲנָשִׁים לְבַד וְהַנָּשִׁים לְבַד; מִכָּאן שֶׁנֶּאֱסְרוּ בְּתַשְׁמִישׁ הַמִּטָּה: (שם):",
    "englishText": "But I will establish My covenant with you, and you shall enter the ark, with your sons, your wife, and your sons’ wives. "
  },
  {
    "id": "Genesis 6:19",
    "chapter": 6,
    "verse": 19,
    "verseHebrew": "",
    "aliyahIndex": 0,
    "aliyahName": "ראשון",
    "mikraHebrew": "וּמִכׇּל־הָ֠חַ֠י מִֽכׇּל־בָּשָׂ֞ר שְׁנַ֧יִם מִכֹּ֛ל תָּבִ֥יא אֶל־הַתֵּבָ֖ה לְהַחֲיֹ֣ת אִתָּ֑ךְ זָכָ֥ר וּנְקֵבָ֖ה יִֽהְיֽוּ׃",
    "targumHebrew": "וּמִכָּל דְּחַי מִכָּל בִּשְׂרָא תְּרֵין מִכֹּלָא תָּעֵיל לְתֵבוֹתָא לְקַיָּמָא עִמָּךְ דְּכַר וְנָקְבָּא יְהוֹן:",
    "rashiText": "<b>ומכל החי.</b> אֲפִלּוּ שֵׁדִים (ב\"ר): <b>שנים מכל.</b> מִן הַפָּחוּת שֶׁבָּהֶם לֹא פָּחוֹת מִשְּׁנַיִם, אֶחָד זָכָר וְאֶחָד נְקֵבָה:",
    "englishText": "And of all that lives, of all flesh, you shall take two of each into the ark to keep alive with you; they shall be male and female. "
  },
  {
    "id": "Genesis 6:20",
    "chapter": 6,
    "verse": 20,
    "verseHebrew": "",
    "aliyahIndex": 0,
    "aliyahName": "ראשון",
    "mikraHebrew": "מֵהָע֣וֹף לְמִינֵ֗הוּ וּמִן־הַבְּהֵמָה֙ לְמִינָ֔הּ מִכֹּ֛ל רֶ֥מֶשׂ הָֽאֲדָמָ֖ה לְמִינֵ֑הוּ שְׁנַ֧יִם מִכֹּ֛ל יָבֹ֥אוּ אֵלֶ֖יךָ לְהַֽחֲיֽוֹת׃",
    "targumHebrew": "מֵעוֹפָא לִזְנוֹהִי וּמִן בְּעִירָא לִזְנַהּ וּמִכֹּל רִחֲשָׁא דְאַרְעָא לִזְנוֹהִי תְּרֵין מִכֹּלָּא יַעֲלוּן לְוָתָךְ לְקַיָּמָא:",
    "rashiText": "<b>מהעוף למינהו.</b> אוֹתָן שֶׁדָּבְקוּ בְמִינֵיהֶם וְלֹא הִשְׁחִיתוּ דַרְכָּם, וּמֵאֵלֵיהֶם בָּאוּ, וְכֹל שֶׁהַתֵּבָה קוֹלַטְתּוֹ הִכְנִיס (ב\"ר):",
    "englishText": "From birds of every kind, cattle of every kind, every kind of creeping thing on earth, two of each shall come to you to stay alive. "
  },
  {
    "id": "Genesis 6:21",
    "chapter": 6,
    "verse": 21,
    "verseHebrew": "",
    "aliyahIndex": 0,
    "aliyahName": "ראשון",
    "mikraHebrew": "וְאַתָּ֣ה קַח־לְךָ֗ מִכׇּל־מַֽאֲכָל֙ אֲשֶׁ֣ר יֵֽאָכֵ֔ל וְאָסַפְתָּ֖ אֵלֶ֑יךָ וְהָיָ֥ה לְךָ֛ וְלָהֶ֖ם לְאׇכְלָֽה׃",
    "targumHebrew": "וְאַתְּ סַב לָךְ מִכָּל מֵיכַל דִּמִתְאֲכֵל וְתִכְנוֹשׁ לְוָתָךְ וִיהֵי לָךְ וּלְהוֹן לְמֵיכָל:",
    "rashiText": "",
    "englishText": "For your part, take of everything that is eaten and store it away, to serve as food for you and for them.” "
  },
  {
    "id": "Genesis 6:22",
    "chapter": 6,
    "verse": 22,
    "verseHebrew": "",
    "aliyahIndex": 0,
    "aliyahName": "ראשון",
    "mikraHebrew": "וַיַּ֖עַשׂ נֹ֑חַ כְּ֠כֹ֠ל אֲשֶׁ֨ר צִוָּ֥ה אֹת֛וֹ אֱלֹהִ֖ים כֵּ֥ן עָשָֽׂה׃",
    "targumHebrew": "וַעֲבַד נֹח כְּכֹל דִּי פַקֵּיד יָתֵיהּ יְיָ כֵּן עֲבָד:",
    "rashiText": "<b>ויעש נח.</b> זֶה בִּנְיַן הַתֵּבָה:",
    "englishText": "Noah did so; just as God commanded him, so he did."
  }
];
